app/controllers/customer/blog_comments_controller.rb

  def create
    @blog = Blog.find(params[:blog_id])
    @blog_comment = BlogComment.create(blog_comment_params)
    @blog_comment.customer_id = current_customer.id
    @blog_comment.blog_id = @blog.id
    if @blog_comment.save
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "blog_comments" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-05-14 15:50:59.386726"], ["updated_at", "2021-05-14 15:50:59.386726"]]
UPDATE "blog_comments" SET "updated_at" = ?, "blog_id" = ? WHERE "blog_comments"."id" = ?  [["updated_at", "2021-05-14 15:50:59.399789"], ["blog_id", 4], ["id", 1]]
INSERT INTO "blog_comments" ("created_at", "updated_at", "comment", "blog_id", "customer_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-05-16 04:22:44.465960"], ["updated_at", "2021-05-16 04:22:44.465960"], ["comment", "ddd"], ["blog_id", 2], ["customer_id", 1]]

  def destroy
    BlogComment.find_by(id: params[:id], blog_id: params[:blog_id]).destroy
---
DELETE FROM "blog_comments" WHERE "blog_comments"."id" = ?  [["id", 5]]
SELECT  "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."id" = ? AND "blog_comments"."blog_id" = ? LIMIT ?  [["id", 5], ["blog_id", 3], ["LIMIT", 1]]