app/controllers/customer/blogs_controller.rb

  def index
    @blogs = Blog.where(customer_id: params[:customer_id]).order(created_at: :desc)
    @blogs = Kaminari.paginate_array(@blogs).page(params[:page]).per(10)
    @customer = Customer.find(params[:customer_id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @blogs = Blog.where(customer_id: params[:customer_id])
    @blogs = Kaminari.paginate_array(@blogs).page(params[:page]).per(10)
    @blog_new = Blog.new(blog_params)
    @blog_new.customer_id = current_customer.id
    if blog_params["blog_images_images"].count > 9
---
SELECT "blog_images".* FROM "blog_images" WHERE "blog_images"."blog_id" = ?  [["blog_id", 1]]