app/controllers/customer/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    @blogs = Blog.where(customer_id: params[:customer_id]).order(created_at: :desc)
    @blogs = Kaminari.paginate_array(@blogs).page(params[:page]).per(10)

INSERT INTO "blogs" ("created_at", "updated_at", "blog_title", "blog_text") VALUES (?, ?, ?, ?)  [["created_at", "2021-05-14 03:01:48.494067"], ["updated_at", "2021-05-14 03:01:48.494067"], ["blog_title", "東京に行った"], ["blog_text", "楽しかったです"]]
---
  def create
    @blogs = Blog.where(customer_id: params[:customer_id])
    @blogs = Kaminari.paginate_array(@blogs).page(params[:page]).per(10)
    @blog_new = Blog.new(blog_params)
    @blog_new.customer_id = current_customer.id
    if @blog_new.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @blogs = Blog.where(customer_id: params[:customer_id])
    @blog_new = Blog.new
    @blog = Blog.find(params[:id])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 5]]
---
  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy