app/controllers/customer/events_controller.rb

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]