app/controllers/customer/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at", "join_day", "artist_name", "message") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-05-13 12:46:53.945490"], ["updated_at", "2021-05-13 12:46:53.945490"], ["join_day", "2021-05-22"], ["artist_name", "嵐"], ["message", "ああ"]]
---
  def create
    @event = Event.new(event_params)
    @event.customer_id = current_customer.id
    if @event.save

SELECT "events".* FROM "events" WHERE "events"."customer_id" = ?  [["customer_id", 3]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @events = Event.where(customer_id: params[:customer_id]).order(start_time: :asc)
    @events = Kaminari.paginate_array(@events).page(params[:page]).per(10)
    @customer = Customer.find(params[:customer_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @events = Event.all
    @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy