app/views/customer/blogs/index.html.erb

              <td>
                <% if blog.blog_images.present? %>
                <% blog.blog_images.first(4).each do |image| %>
---
SELECT "blogs".* FROM "blogs"

              </td>
              <td><%= "#{blog.blog_comments.count}コメント" %></td>
---
SELECT "blogs".* FROM "blogs"