app/views/customer/blogs/show.html.erb

SELECT COUNT(*) FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 2]]
SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."blog_id" = ?  [["blog_id", 2]]
---
    </div>
    <span>コメント数:<%= @blog.blog_comments.count %></span>